Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0128GPM064.atdf
      <value-group caption="CCPx Time Base Clock Select" name="CCP8CON1__CLKSEL">
         <value caption="System Clock (Fsys)" name="" value="0x0" />
         <value caption="REFCLKO Output Clock" name="" value="0x1" />
         <value caption="Secondary Oscillator Clock (SOSC)" name="" value="0x2" />
         <value caption="CLC1 Output" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="TCKIB Pin (remappable)" name="" value="0x6" />
         <value caption="TCKIA Pin (remappable)" name="" value="0x7" />
      </value-group>
      <value-group caption="CCPx Auto shutdown/Gating Source Enable" name="CCP8CON2__ASDG">
         <value caption="Disabled" name="" value="0x0" />
         <value caption="Comparator 1" name="" value="0x1" />
         <value caption="Comparator 2" name="" value="0x2" />
         <value caption="Comparator 3" name="" value="0x4" />
         <value caption="MCCP2 output" name="" value="0x8" />
         <value caption="MCCP1 output" name="" value="0x10" />
         <value caption="CLC1 output" name="" value="0x20" />
         <value caption="OCFA pin (remappable)" name="" value="0x40" />
         <value caption="OCFB pin (remappable)" name="" value="0x80" />
      </value-group>
      <value-group caption="CCPx Input Capture Source Select" name="CCP8CON2__ICS">
         <value caption="ICM8 pin (remappable)" name="" value="0x0" />
         <value caption="Comparator 1 Output" name="" value="0x1" />
         <value caption="Comparator 2 Output" name="" value="0x2" />
         <value caption="Comparator 3 Output" name="" value="0x3" />
         <value caption="CLC1 Output" name="" value="0x4" />
         <value caption="CLC2 Output" name="" value="0x5" />
         <value caption="CLC3 Output" name="" value="0x6" />
         <value caption="CLC4 Output" name="" value="0x7" />
      </value-group>
      <value-group caption="CCPx Time Base Clock Select" name="CCP9CON1__CLKSEL">
         <value caption="System Clock (Fsys)" name="" value="0x0" />
         <value caption="REFCLKO Output Clock" name="" value="0x1" />
         <value caption="Secondary Oscillator Clock (SOSC)" name="" value="0x2" />
         <value caption="CLC1 Output" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="TCKIB Pin (remappable)" name="" value="0x6" />
         <value caption="TCKIA Pin (remappable)" name="" value="0x7" />
      </value-group>
      <value-group caption="CCPx Auto shutdown/Gating Source Enable" name="CCP9CON2__ASDG">
         <value caption="Disabled" name="" value="0x0" />
         <value caption="Comparator 1" name="" value="0x1" />
         <value caption="Comparator 2" name="" value="0x2" />
         <value caption="Comparator 3" name="" value="0x4" />
         <value caption="MCCP2 output" name="" value="0x8" />
         <value caption="MCCP1 output" name="" value="0x10" />
         <value caption="CLC2 output" name="" value="0x20" />
         <value caption="OCFA pin (remappable)" name="" value="0x40" />
         <value caption="OCFB pin (remappable)" name="" value="0x80" />
      </value-group>
      <value-group caption="CCPx Input Capture Source Select" name="CCP9CON2__ICS">
         <value caption="ICM9 pin (remappable)" name="" value="0x0" />
         <value caption="Comparator 1 Output" name="" value="0x1" />
         <value caption="Comparator 2 Output" name="" value="0x2" />
         <value caption="Comparator 3 Output" name="" value="0x3" />
         <value caption="CLC1 Output" name="" value="0x4" />
         <value caption="CLC2 Output" name="" value="0x5" />
         <value caption="CLC3 Output" name="" value="0x6" />
         <value caption="CLC4 Output" name="" value="0x7" />
      </value-group>
   </module>
   <module caption="" id="01445" name="CDAC" version="">
      <register-group name="CDAC">
         <register caption="CDAC Control Register" name="DAC1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Reference Source Select" mask="0x00000003" name="REFSEL" values="DAC1CON__REFSEL" />
            <bitfield caption="CDAC Output Enable" mask="0x00000100" name="DACOE" values="DAC1CON__DACOE" />
            <bitfield caption="CDAC Enable" mask="0x00008000" name="ON" values="DAC1CON__ON" />
            <bitfield caption="Data Input Register Bits for the CDAC" mask="0xFFFF0000" name="DACDAT" />
         </register>
      </register-group>
      <value-group caption="Reference Source Select" name="DAC1CON__REFSEL">
         <value caption="No reference is selected (output is AVSS)" name="" value="0x0" />
         <value caption="Reference voltage is the CVREF+ input pin voltage" name="" value="0x1" />
         <value caption="No reference is selected (output is AVSS)" name="" value="0x2" />
         <value caption="Reference voltage is AVDD" name="" value="0x3" />
      </value-group>
      <value-group caption="CDAC Output Enable" name="DAC1CON__DACOE">
         <value caption="Output is Disabled; drive to pin is floating" name="" value="0x0" />
         <value caption="Output is Enabled; CDAC voltage is connected to the pin." name="" value="0x1" />
      </value-group>
      <value-group caption="CDAC Enable" name="DAC1CON__ON">
         <value caption="The CDAC is Disabled" name="" value="0x0" />
         <value caption="The CDAC is Enabled" name="" value="0x1" />
      </value-group>
   </module>
   <module caption="" id="02922" name="CFG" version="">
      <register-group name="CFG">
         <register caption="" name="PMDCON" offset="0xca0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000800" name="PMDLOCK" />
         </register>
         <register caption="" name="PMD1" offset="0xcb0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ADCMD" />
            <bitfield caption="" mask="0x00001000" name="VREFMD" />
            <bitfield caption="" mask="0x00100000" name="HLVDMD" />
         </register>
