Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0128GPM064.atdf
         <register caption="" name="PR1" offset="0x20" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="PR1" />
         </register>
      </register-group>
      <value-group caption="Timer Clock Source Select bit" name="T1CON__TCS">
         <value caption="External clock is defined by the TECS bits" name="" value="0x1" />
         <value caption="Internal peripheral clock" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer External Clock Input Synchronization Selection bit" name="T1CON__TSYNC">
         <value caption="(When TCS is 1) External clock input is synchronized / (When TCS is 0) This bit is ignored" name="" value="0x1" />
         <value caption="(When TCS is 1) External clock input is not synchronized / (When TCS is 0) This bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T1CON__TCKPS">
         <value caption="1:256 prescale value" name="" value="0x3" />
         <value caption="1:64 prescale value" name="" value="0x2" />
         <value caption="1:8 prescale value" name="" value="0x1" />
         <value caption="1:1 prescale value" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T1CON__TGATE">
         <value caption="(When TCS is 0) Gated time accumulation is enabled / (When TCS is 1) bit is ignored" name="" value="0x1" />
         <value caption="(When TCS is 0) Gated time accumulation is disabled / (When TCS is 1) bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer1 External Clock Selection bits" name="T1CON__TECS">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="External clock comes from the LPRC" name="LPRC" value="0x2" />
         <value caption="External clock comes from the T1CK pin" name="T1CK_PIN" value="0x1" />
         <value caption="External clock comes from the SOSC" name="SOSC" value="0x0" />
      </value-group>
      <value-group caption="Asynchronous Timer Write in Progress bit" name="T1CON__TWIP">
         <value caption="(In Asynchronous Timer mode) Asynchronous write to TMR1 register in progress / (In Synchronous Timer mode)bit is read as 0" name="" value="0x1" />
         <value caption="In Asynchronous Timer mode Asynchronous write to TMR1 register complete / (In Synchronous Timer mode)bit is read as 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Asynchronous Timer Write Disable bit" name="T1CON__TWDIS">
         <value caption="Writes to TMR1 are ignored until pending write operation completes" name="" value="0x1" />
         <value caption="Back-to-back writes are enabled (Legacy Asynchronous Timer functionality)" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T1CON__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation even in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer On bit" name="T1CON__ON">
         <value caption="Timer is enabled" name="" value="0x1" />
         <value caption="Timer is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00745" name="TMR" version="1">
      <register-group name="TMR">
         <register caption="Type B Timer Control Register" name="T2CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T2CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T2CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T2CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T2CON__TGATE" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T2CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T2CON__ON" />
         </register>
         <register caption="Type B Timer Control Register" name="T3CON" offset="0x40" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T3CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T3CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T3CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T3CON__TGATE" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T3CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T3CON__ON" />
         </register>
         <register caption="" name="TMR2" offset="0x10" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="TMR2" />
         </register>
         <register caption="" name="TMR3" offset="0x50" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="TMR3" />
         </register>
         <register caption="" name="PR2" offset="0x20" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="PR2" />
         </register>
         <register caption="" name="PR3" offset="0x60" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="PR3" />
         </register>
      </register-group>
      <value-group caption="Timer Clock Source Select bit" name="T2CON__TCS">
         <value caption="External clock from TxCK pin" name="" value="0x1" />
         <value caption="Internal peripheral clock" name="" value="0x0" />
      </value-group>
      <value-group caption="32-Bit Timer Mode Select bit" name="T2CON__T32">
         <value caption="Odd numbered and even numbered timers form a 32-bit timer" name="" value="0x1" />
         <value caption="Odd numbered and even numbered timers form separate 16-bit timers" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T2CON__TCKPS">
         <value caption="1:256 prescale value" name="" value="0x7" />
         <value caption="1:64 prescale value" name="" value="0x6" />
         <value caption="1:32 prescale value" name="" value="0x5" />
         <value caption="1:16 prescale value" name="" value="0x4" />
         <value caption="1:8 prescale value" name="" value="0x3" />
         <value caption="1:4 prescale value" name="" value="0x2" />
         <value caption="1:2 prescale value" name="" value="0x1" />
         <value caption="1:1 prescale value" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T2CON__TGATE">
         <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is enabled" name="" value="0x1" />
         <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T2CON__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation even in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer On bit" name="T2CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Module is disabled" name="" value="0x0" />
      </value-group>
